// Azure Keyvault Secrets Modified or Deleted
AzureActivity 
| where OperationNameValue =~ 'MICROSOFT.KEYVAULT/VAULTS/SECRETS/WRITE'
    or OperationNameValue =~ 'MICROSOFT.KEYVAULT/VAULTS/SECRETS/DELETE'
    or OperationNameValue =~ 'MICROSOFT.KEYVAULT/VAULTS/SECRETS/BACKUP/ACTION'
    or OperationNameValue =~ 'MICROSOFT.KEYVAULT/VAULTS/SECRETS/PURGE/ACTION'
    or OperationNameValue =~ 'MICROSOFT.KEYVAULT/VAULTS/SECRETS/UPDATE/ACTION'
    or OperationNameValue =~ 'MICROSOFT.KEYVAULT/VAULTS/SECRETS/RECOVER/ACTION'
    or OperationNameValue =~ 'MICROSOFT.KEYVAULT/VAULTS/SECRETS/RESTORE/ACTION'
    or OperationNameValue =~ 'MICROSOFT.KEYVAULT/VAULTS/SECRETS/SETSECRET/ACTION'
