// failed login account in specific time
// Identifies failed accounts more than x times, and last login attempted 
// Event ID 4625: failed log in
// Event ID 4624: An account was successfully logged on
// Account able to login after many failed login

let timeframe = 3d;
let suspicious_users = 
    SecurityEvent
    | where TimeGenerated > ago(timeframe)
    | where AccountType == "user@domain.com"  and EventID == 4625 
    | summarize failed_login_attempts=count(), latest_failed_login=arg_max(TimeGenerated, Account) by Account 
    | where failed_login_attempts > 5
    | project-away Account1;

// An account was successfully logged on after many failed login

let suspicious_users_that_later_logged_in = 
    suspicious_users 
    | join kind=innerunique (
        SecurityEvent
        | where TimeGenerated > ago(timeframe)
        | where AccountType == "user@domain.com" and EventID == 4624 
        | summarize latest_successful_login=arg_max(TimeGenerated, Account) by Account
    ) on Account
    | extend was_login_after_failures = iif(latest_successful_login>latest_failed_login, 1, 0)
    | where was_login_after_failures == 5
;
suspicious_users_that_later_logged_in
