// List all accounts that logged on using a clear-text password over the last day. 
// event ID 4624: an account was successfully logged on
// logon type 8: NetworkCleartext
// count the reported security events for each account

SecurityEvent
| where EventID == 4624 
| where LogonType == 8
| summarize count() by TargetAccount

