// Lateral Account Movement with explicit credentials
let timeFrame = 5d;
let ignoredAccounts = dynamic(["IgnoredAccountName"]);
let knownTargets = datatable (user:string) ["Elli Shlomo, Shlomo Ellim"];
let allChanges = SecurityEvent
                | where TimeGenerated >= ago(timeFrame)
                | extend SubjectUserName = tolower(SubjectUserName), TargetUserName = tolower(TargetUserName)
                | where EventID == 4648 
                    and SubjectUserName !endswith "$" 
                    and TargetUserName !endswith "$" 
                    and SubjectUserName != TargetUserName 
                    and SubjectUserName !in (ignoredAccounts) 
                    and TargetUserName !in (ignoredAccounts)
                | where SubjectUserName != "-" 
                    and TargetUserName != "-" 
                    and isnotempty(SubjectUserName) 
                    and isnotempty(TargetUserName)
                | extend user = strcat(SubjectUserName, " , ", TargetUserName)
                | distinct user;
allChanges | join kind = leftanti knownTargets on user
