// Identify Lockbit with MDE // Simple query with DeviceProcessEvents and DeviceFileEvents tables only
let Lockbit = dynamic ([
    "b3faf5d8cbc3c75d4c3897851fdaf8d7a4bd774966b4c25e0e4617546109aed5",
    "b4f8f77dac0609f9e8fb24d85d5b4234deee2a96d8776e75895d779490a91073",
    "ca907cf9ee5bba95a35d8fe8b62cbef18037cc2e152b1b3d6f7639007d9fcac1",
    "faa3453ceb1bd4e5b0b10171eaa908e56e7275173178010fcc323fdea67a6869",
    "a5fe09b4d955e8fc79727858e5b1a0733f710313e60",
    "ffbb6c4d8d704a530bdd557890f367ad904c09c03f53fda5615a7208a0ea3e4d",
    "286bffaa9c81abfb938fe65be198770c38115cdec95865a241f913769e9bfd3f",
    "76a77def28acf51b2b7cdcbfaa182fe5726dd3f9e891682a4efc3226640b9c78",
    "faa3453ceb1bd4e5b0b10171eaa908e56e7275173178010fcc323fdea67a6869",
    "70cb1a8cb4259b72b704e81349c2ad5ac60cd1254a810ef68757f8c9409e3ea6",
    "ec88f821d22e5553afb94b4834f91ecdedeb27d9ebfd882a7d8f33b5f12ac38d",
    "13849c0c923bfed5ab37224d59e2d12e3e72f97dc7f539136ae09484cbe8e5e0",
    "6fedf83e76d76c59c8ad0da4c5af28f23a12119779f793fd253231b5e3b00a1a",
    "c8205792fbc0a5efc6b8f0f2257514990bfaa987768c4839d413dd10721e8871",
    "15a7d528587ffc860f038bb5be5e90b79060fbba5948766d9f8aa46381ccde8a",
    "0f5d71496ab540c3395cfc024778a7ac5c6b5418f165cc753ea2b2befbd42d51",
    "0e66029132a885143b87b1e49e32663a52737bbff4ab96186e9e5e829aa2915f",
    "410c884d883ebe2172507b5eadd10bc8a2ae2564ba0d33b1e84e5f3c22bd3677",
    "e3f236e4aeb73f8f8f0caebe46f53abbb2f71fa4b266a34ab50e01933709e877",	
    "0f178bc093b6b9d25924a85d9a7dde64592215599733e83e3bbc6df219564335",	
    "1b109db549dd0bf64cadafec575b5895690760c7180a4edbf0c5296766162f18",	
    "26b6a9fecfc9d4b4b2c2ff02885b257721687e6b820f72cf2e66c1cae2675739",	
    "69d9dd7fdd88f33e2343fb391ba063a65fe5ffbe649da1c5083ec4a67c525997",	
    "0a937d4fe8aa6cb947b95841c490d73e452a3cafcd92645afc353006786aba76",	
    "1e3bf358c76f4030ffc4437d5fcd80c54bd91b361abb43a4fa6340e62d986770",	
    "5072678821b490853eff0a97191f262c4e8404984dd8d5be1151fef437ca26db",	
    "ca57455fd148754bf443a2c8b06dc2a295f014b071e3990dd99916250d21bc75"        
    ]);
DeviceFileEvents
| where SHA256 in(Lockbit)

DeviceProcessEvents 
| where ((InitiatingProcessCommandLine contains 'Notification_Suppress /t REG_DWORD /d 1 /F') and (FolderPath endswith @'\\reg.exe'))


// More artifacts
//REG:	HKCU\SOFTWARE\Microsoft\Windows\CurrentVersion\Run, HKCU\SOFTWARE\Microsoft\Windows\CurrentVersion\Run\random-generated-letters, HKCU\SOFTWARE\LockBit
//Ransom-note:	Restore-My-Files.txt
//Network IOC’s: Lockbitks2tvnmwk[.]onion, Ocsp.usertrust[.]com,Crl.usertrust[.]com
