### TOP PowerShell Dangerous Commands for Azure Sentinel Hunting 

let timeframe = 7d;
union Event, SecurityEvent
| where TimeGenerated >= ago(timeframe)
| where EventID in (4103, 4104, 4105, 4688)
| where EventData contains "Relvant commands from the list below (can be one or more command)"

- PowerShell Command list -

	Write-CMDServiceBinary
	Write-UserAddMSI
	Write-ServiceEXE
	Write-ServiceEXECMD
	Restore-ServiceEXE
	Invoke-ServiceStart
	Invoke-ServiceStop
	Find-AVSignature	
	ReflectivePEInjection
	Invoke-Shellcode
	Invoke--Shellcode
	Invoke-ShellcodeMSIL
	Get-GPPPassword
	Get-Keystrokes
	Get-TimedScreenshot
	Get-VaultCredential
	Invoke-CredentialInjection
	Invoke-NinjaCopy
	Invoke-TokenManipulation
	Out-Minidump
	Set-MasterBootRecord
	New-ElevatedPersistenceOption
	Invoke-CallbackIEX
	Invoke-PSInject
	Invoke-DllEncode
	Get-ServiceUnquoted
	Get-ServiceEXEPerms
	Get-ServicePerms
	Invoke-ServiceUserAdd
	Invoke-ServiceCMD
	Write-UserAddServiceBinary
    Invoke-ServiceEnable
	Invoke-ServiceDisable
	Invoke-FindDLLHijack
	Invoke-FindPathHijack
	Get-RegAlwaysInstallElevated
	Get-RegAutoLogon
	Get-UnattendedInstallFiles
	Get-Webconfig
	Get-ApplicationHost
	Invoke-AllChecks
	Invoke-MassCommand
	Invoke-MassMimikatz
	Invoke-MassSearch
	Invoke-MassTemplate
	Invoke-MassTokens
	HTTP-Backdoor
	Add-ScrnSaveBackdoor
	Gupt-Backdoor
	Invoke-ADSBackdoor
	Execute-OnTime
	DNS_TXT_Pwnage
	Enable-DuplicateToken 
	Remove-Update
	Execute-DNSTXT-Code
	Download-Execute-PS
	Execute-Command-MSSQL
	Download_Execute
	Get-PassHashes
	Invoke-CredentialsPhish
	Get-LsaSecret
	Get-Information
	Invoke-MimikatzWDigestDowngrade
	Invoke-NetworkRelay
	Create-MultipleSessions
	Run-EXEonRemote
	Invoke-BruteForce
 	Get-PSADForestKRBTGTInfo
	Discover-PSMSSQLServers
	Discover-PSMSExchangeServers
	Get-PSADForestInfo
	Get-KerberosPolicy
	Discover-PSInterestingServices
	Port-Scan
	Invoke-PowerShellIcmp
	Invoke-PowerShellUdp
	Invoke-PsGcatAgent
	Invoke-PoshRatHttps
	Invoke-PowerShellTcp
	Invoke-PoshRatHttp
	Invoke-PowerShellWmi
	Invoke-PSGcat
	Remove-PoshRat
	TexttoEXE
	Invoke-Encode
	Invoke-Decode
	StringtoBase64
	Do-Exfiltration
	Parse_Keys
	Add-Exfiltration
	Add-Persistence
	Remove-Persistence
	Invoke-CreateCertificate