// Explicit credentials processes in specific time
// Event ID 4648: A logon was attempted using explicit credentials
SecurityEvent
| where TimeGenerated > ago(7d)
| where EventID == 4648
| summarize count() by Process
| render piechart

