// Tor IP Detection with _GetWatchlist
let TorIP = _GetWatchlist('TOREN') | extend CallerIpAddress = ip;
AzureActivity
| where CallerIpAddress != 
| extend Impacted = Caller, ResourceName = tostring(parse_json(Properties).resource)
| join TorIP on CallerIpAddress 
| project TimeGenerated, SearchKey, OperationNameValue, Type, SubscriptionId, WhoDidIt, ResourceName, ResourceGroup
