// Tor IP Detection with _GetWatchlist
let TorIP = _GetWatchlist('TOREN');
AzureActivity
| where CallerIpAddress != ''
| extend WhoDidIt = Caller, ResourceName = tostring(parse_json(Properties).resource)
| join TorIP on $left.CallerIpAddress == $right.ip
| project TimeGenerated, OperationNameValue, Type, SubscriptionId, ResourceName, ResourceGroup
