// Based on the clear explnation from Huntress > https://www.huntress.com/blog/microsoft-office-remote-code-execution-follina-msdt-bug
// The recommendations for PowerShell Obfuscation > https://misconfig.io/powershell-hunting-with-microsoft-sentinel/
// Follina Detection Query with Office exe, ProcessCommandLine, and RemoteIP and Success Connections with PowerShell Download 

// --------------------------------------------------------------------------------------------

let Parent = dynamic(['outlook.exe']); // Add any Office Exe
let MalPROC = dynamic(['sdiagnhost.exe','msdt.exe']);
let follina = dynamic([
'start-Process $cmd -windowstyle hidden -ArgumentList "/c taskkill /f /im msdt.exe"',
'$cmd',
'Invoke-Expression',
'/r %temp% %i'
]); // You can add any Base64 encoded data
union DeviceEvents, DeviceNetworkEvents, DeviceProcessEvents
| where InitiatingProcessParentFileName has_any (Parent)
    and ProcessCommandLine has_any (MalPROC)
| where ProcessCommandLine has "Net.WebClient"
   or ProcessCommandLine has "DownloadFile"
   or ProcessCommandLine has "Invoke"   
   or ProcessCommandLine has "http"
   or ProcessCommandLine has "IEX"   
   or ProcessCommandLine has "msdt.exe"
| where RemoteIPType == "Public"
| where ActionType == "ConnectionSuccess"
